# TemporaryChangesOutOfDate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..TemporaryChangesOutOfDate Property
BuiltInFailures..::..EditingFailures Class See Also
---
You must Reload Latest before editing the element. Changes will be temporary, and will not be saved.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TemporaryChangesOutOfDate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TemporaryChangesOutOfDate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TemporaryChangesOutOfDate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace